---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.FabricFailures
source: html/1e10bead-55d2-51cb-dd33-80ed534cb0a8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures

Failures about Fabric.

## Syntax (C#)
```csharp
public static class FabricFailures
```